pmorgantech/WaveX/firmware/esp32/main/ui_task.cpp
/**
 * @file ui_task.cpp
 * @brief UI Task Implementation for MIPI DSI Display with LVGL
 * 
 * This implementation provides full LVGL integration with MIPI DSI display
 * using the Waveshare 5-DSI-TOUCH-A display and HX8394 driver.
 */

#include "ui_task.h"
#include "esp_log.h"
#include "esp_check.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "driver/gpio.h"
#include "driver/i2c_master.h"
#include "hardware_pins.h"
#include "inter_mcu.h"
#include "comm/statistics.h"
#include "links/spi_link.h"
 
// LVGL includes
#include "esp_lvgl_port.h"
#include "esp_lcd_touch.h"
#include "esp_lcd_touch_gt911.h"
#include "esp_lcd_io_i2c.h"
#include "esp_heap_caps.h"
#include "esp_timer.h"

// LVGL port lock macros for thread safety
#define LV_LOCK()   lvgl_port_lock(portMAX_DELAY)
#define LV_UNLOCK() lvgl_port_unlock()

// Include BSP header for display functions
#include "bsp/esp32_p4_nano.h"
 
#define LV_TICK_PERIOD_MS 20
 
 static const char *TAG = "UI_TASK";
 
 // Task handle
 static TaskHandle_t s_ui_task_handle = NULL;
 
// Display and LVGL handles
static esp_lcd_panel_handle_t s_panel_handle = NULL;
static esp_lcd_touch_handle_t s_touch_handle = NULL;
static lv_display_t *s_lvgl_display = NULL;
static esp_timer_handle_t s_lvgl_tick_timer_handle = NULL;
static esp_timer_handle_t s_diagnostics_timer_handle = NULL;
static esp_timer_handle_t s_meter_timer_handle = NULL;
 
// I2C handles
static i2c_master_bus_handle_t s_i2c_bus_handle = NULL;

// UI element references for real-time updates
static lv_obj_t *s_diagnostics_label = NULL;
static lv_obj_t *s_content_area = NULL;

// Meter callback system
static wavex_meter_cb_t s_meter_callback = NULL;
static void* s_meter_user_data = NULL;

// CPU monitoring variables
static uint32_t s_cpu_idle_count = 0;
static uint32_t s_cpu_total_count = 0;
static uint32_t s_last_cpu_check = 0;
static float s_cpu_usage_percent = 0.0f;
static float s_cpu_usage_core0 = 0.0f;
static float s_cpu_usage_core1 = 0.0f;

// Meter data variables
static float s_current_rms = 0.0f;
static float s_current_peak = 0.0f;
static lv_obj_t *s_meter_bar = NULL;
static lv_obj_t *s_meter_label = NULL;

// Enhanced meter display variables
static lv_obj_t *s_meter_bar_l = NULL;
static lv_obj_t *s_meter_bar_r = NULL;
static lv_obj_t *s_peak_line_l = NULL;
static lv_obj_t *s_peak_line_r = NULL;
static lv_obj_t *s_meter_label_l = NULL;
static lv_obj_t *s_meter_label_r = NULL;

// Peak hold tracking
struct PeakHoldData {
    float peak_value;
    uint32_t peak_time_ms;
    bool is_holding;
};
static PeakHoldData s_peak_hold_l = {0.0f, 0, false};
static PeakHoldData s_peak_hold_r = {0.0f, 0, false};
static const uint32_t PEAK_HOLD_TIMEOUT_MS = 500;  // Configurable peak hold duration
 
// Forward declarations
static void ui_task(void *pvParameters);
static void lvgl_flush_cb(lv_display_t *disp, const lv_area_t *area, uint8_t *px_map);
static void lvgl_tick_cb(void *arg);
static void diagnostics_update_cb(void *arg);
static void meter_update_cb(void *arg);
static void update_cpu_usage(void);
static void meter_data_cb(float rms, float peak, void* user_data);
static esp_err_t init_touch_controller(void);

// Enhanced meter functions
static void update_peak_hold(PeakHoldData* peak_data, float current_peak, uint32_t current_time_ms);
static void update_peak_line_position(lv_obj_t* peak_line, lv_obj_t* meter_bar, float peak_value);
static void create_enhanced_meter_display(lv_obj_t* parent);
static esp_err_t init_lvgl_display(void);

// Menu system functions
static void create_main_menu(lv_obj_t *parent);
static void create_system_menu(lv_obj_t *parent);
static void create_diagnostics_page(lv_obj_t *parent);
static void menu_button_event_cb(lv_event_t *e);
static void touch_event_cb(lv_event_t *e);
 
/**
 * @brief Initialize touch controller with custom configuration
 */
static esp_err_t init_touch_controller(void)
{
    ESP_LOGI(TAG, "Initializing GT911 touch controller with custom config...");

    // Use BSP's I2C handle to avoid conflicts
    i2c_master_bus_handle_t i2c_handle = bsp_i2c_get_handle();
    if (i2c_handle == NULL) {
        ESP_LOGE(TAG, "BSP I2C not initialized, initializing it first");
        ESP_RETURN_ON_ERROR(bsp_i2c_init(), TAG, "Failed to initialize BSP I2C");
        i2c_handle = bsp_i2c_get_handle();
    }

    // Configure touch reset and interrupt pins for GT911 address selection
    gpio_config_t io_conf = {
        .pin_bit_mask = (1ULL << GPIO_NUM_14) | (1ULL << GPIO_NUM_15),  // RST and INT pins
        .mode = GPIO_MODE_OUTPUT,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE,
    };
    ESP_RETURN_ON_ERROR(gpio_config(&io_conf), TAG, "Failed to configure touch GPIO pins");

    // --- GT911 Reset and Address Selection Sequence ---
    // Per datasheet, this selects the I2C address. We will select 0x5D.
    gpio_set_level(GPIO_NUM_15, 1);  // INT high for address 0x5D
    gpio_set_level(GPIO_NUM_14, 0);  // RST low
    vTaskDelay(pdMS_TO_TICKS(10));
    gpio_set_level(GPIO_NUM_14, 1);  // RST high
    vTaskDelay(pdMS_TO_TICKS(60)); // Hold INT state for >50ms after reset

    // Release INT pin to be an input for interrupts
    io_conf.pin_bit_mask = (1ULL << GPIO_NUM_15);  // Only INT pin
    io_conf.mode = GPIO_MODE_INPUT;
    io_conf.pull_up_en = GPIO_PULLUP_ENABLE; // INT line usually requires a pull-up
    ESP_RETURN_ON_ERROR(gpio_config(&io_conf), TAG, "Failed to reconfigure INT pin to input");

    vTaskDelay(pdMS_TO_TICKS(10)); // Settle time
    // --- End of GT911 Sequence ---

    // Create I2C panel IO for touch controller using BSP's I2C handle
    esp_lcd_panel_io_i2c_config_t io_config = {
        .dev_addr = ESP_LCD_TOUCH_IO_I2C_GT911_ADDRESS, // Use 0x5D address
        .control_phase_bytes = 1,
        .dc_bit_offset = 0,
        .lcd_cmd_bits = 8,
        .lcd_param_bits = 8,
        .flags = {
            .dc_low_on_data = 0,
            .disable_control_phase = 0,
        },
        .scl_speed_hz = 400000,  // 400kHz for GT911
    };

    esp_lcd_panel_io_handle_t io_handle = NULL;
    ESP_RETURN_ON_ERROR(esp_lcd_new_panel_io_i2c_v2(i2c_handle, &io_config, &io_handle),
                       TAG, "Failed to create I2C panel IO");

    // Configure GT911 touch controller with correct orientation for 720x1280 display
    esp_lcd_touch_config_t touch_config = {
        .x_max = BSP_LCD_H_RES,
        .y_max = BSP_LCD_V_RES,
        .rst_gpio_num = GPIO_NUM_14,  // Touch reset pin
        .int_gpio_num = GPIO_NUM_15,  // Touch interrupt pin
        .levels = {
            .reset = 0,
            .interrupt = 0,
        },
        .flags = {
            .swap_xy = 0,     // No swap for portrait orientation
            .mirror_x = 0,    // No mirror X
            .mirror_y = 0,    // No mirror Y
        },
    };

