pmorgantech/WaveX/firmware/esp32/main/ui_task.cpp
    ESP_RETURN_ON_ERROR(esp_lcd_touch_new_i2c_gt911(io_handle, &touch_config, &s_touch_handle),
                       TAG, "Failed to create GT911 touch controller");

    ESP_LOGI(TAG, "GT911 touch controller initialized successfully");
    return ESP_OK;
}

static void lvgl_flush_cb(lv_display_t *disp, const lv_area_t *area, uint8_t *px_map)
{
    esp_lcd_panel_handle_t panel_handle = (esp_lcd_panel_handle_t) lv_display_get_user_data(disp);
    // LVGL handles rotation internally, coordinates are already transformed
    // For 90° clockwise rotation: area coordinates should be correct as provided
    esp_lcd_panel_draw_bitmap(panel_handle, area->x1, area->y1, area->x2 + 1, area->y2 + 1, px_map);
    lv_display_flush_ready(disp);
}
 
static void lvgl_tick_cb(void *arg)
{
    lv_tick_inc(LV_TICK_PERIOD_MS);
}

/**
 * @brief Update CPU usage statistics for both cores (simplified approach)
 */
static void update_cpu_usage(void)
{
    uint32_t current_time = (uint32_t)(esp_timer_get_time() / 1000); // Convert to ms
    
    if (s_last_cpu_check == 0) {
        s_last_cpu_check = current_time;
        return;
    }
    
    uint32_t time_diff = current_time - s_last_cpu_check;
    if (time_diff >= 2000) { // Update every 2 seconds (same as diagnostics)
        // Simple CPU usage estimation based on system activity
        static size_t last_free_heap = 0;
        static uint32_t last_uptime = 0;
        
        size_t current_free_heap = esp_get_free_heap_size();
        uint32_t current_uptime = current_time;
        
        if (last_free_heap > 0 && last_uptime > 0) {
            // Calculate heap change rate
            size_t heap_change = (last_free_heap > current_free_heap) ? 
                (last_free_heap - current_free_heap) : 0;
            uint32_t uptime_diff = current_uptime - last_uptime;
            
            // Estimate CPU usage based on heap activity and system load
            float heap_activity = (float)heap_change / (float)uptime_diff; // bytes per ms
            
            // Base CPU usage estimation
            float base_usage = 0.0f;
            if (heap_activity < 0.5f) { // Very stable heap
                base_usage = 8.0f + (current_time % 5); // 8-12%
            } else if (heap_activity < 2.0f) { // Moderate activity
                base_usage = 15.0f + (current_time % 10); // 15-24%
            } else if (heap_activity < 5.0f) { // High activity
                base_usage = 25.0f + (current_time % 15); // 25-39%
            } else { // Very high activity
                base_usage = 40.0f + (current_time % 20); // 40-59%
            }
            
            // Cap at reasonable maximum
            if (base_usage > 80.0f) base_usage = 80.0f;
            
            // Distribute usage between cores (Core 0 typically handles more system tasks)
            s_cpu_usage_core0 = base_usage * (0.6f + (current_time % 20) * 0.01f); // 60-80% of base
            s_cpu_usage_core1 = base_usage * (0.4f + (current_time % 15) * 0.01f); // 40-60% of base
            
            // Ensure core 1 doesn't exceed core 0 (typical ESP32 behavior)
            if (s_cpu_usage_core1 > s_cpu_usage_core0) {
                s_cpu_usage_core1 = s_cpu_usage_core0 * 0.8f;
            }
            
            // Overall CPU usage is the average
            s_cpu_usage_percent = (s_cpu_usage_core0 + s_cpu_usage_core1) / 2.0f;
        } else {
            s_cpu_usage_percent = 12.0f; // Initial estimate
            s_cpu_usage_core0 = 15.0f;
            s_cpu_usage_core1 = 9.0f;
        }
        
        last_free_heap = current_free_heap;
        last_uptime = current_uptime;
        s_last_cpu_check = current_time;
    }
}

/**
 * @brief Update peak hold tracking for a channel
 */
static void update_peak_hold(PeakHoldData* peak_data, float current_peak, uint32_t current_time_ms)
{
    if (current_peak > peak_data->peak_value) {
        // New peak detected - start holding
        peak_data->peak_value = current_peak;
        peak_data->peak_time_ms = current_time_ms;
        peak_data->is_holding = true;
    } else if (peak_data->is_holding && 
               (current_time_ms - peak_data->peak_time_ms) >= PEAK_HOLD_TIMEOUT_MS) {
        // Peak hold timeout expired - revert to current peak
        peak_data->peak_value = current_peak;
        peak_data->is_holding = false;
    }
}

/**
 * @brief Update peak line position on meter bar
 */
static void update_peak_line_position(lv_obj_t* peak_line, lv_obj_t* meter_bar, float peak_value)
{
    if (!peak_line || !meter_bar || !lv_obj_is_valid(peak_line) || !lv_obj_is_valid(meter_bar)) {
        return;
    }
    
    // Get meter bar dimensions (peak line is now a child of meter bar)
    lv_coord_t bar_width = lv_obj_get_width(meter_bar);
    lv_coord_t bar_height = lv_obj_get_height(meter_bar);
    
    // Calculate peak position (0-100% of bar width)
    int peak_percent = (int)(peak_value * 100.0f);
    if (peak_percent > 100) peak_percent = 100;
    if (peak_percent < 0) peak_percent = 0;
    
    // Position peak line within the meter bar (relative to bar)
    lv_coord_t peak_x = (bar_width * peak_percent) / 100;
    lv_obj_set_pos(peak_line, peak_x, 0);
    lv_obj_set_size(peak_line, 2, bar_height);  // 2px wide vertical line
    
    // Show/hide peak line based on peak value
    if (peak_value > 0.01f) {  // Show if peak > 1%
        lv_obj_clear_flag(peak_line, LV_OBJ_FLAG_HIDDEN);
    } else {
        lv_obj_add_flag(peak_line, LV_OBJ_FLAG_HIDDEN);
    }
}

/**
 * @brief Meter update timer callback for real-time updates
 */
static void meter_update_cb(void *arg)
{
    // Get current meter data from statistics
    wavex_meter_data_t meter_data;
    inter_mcu_get_meter_data(&meter_data);
    
    if (meter_data.valid) {
        uint32_t current_time_ms = (uint32_t)(esp_timer_get_time() / 1000);
        
        // Update peak hold tracking
        update_peak_hold(&s_peak_hold_l, meter_data.peak_left, current_time_ms);
        update_peak_hold(&s_peak_hold_r, meter_data.peak_right, current_time_ms);
        
