pmorgantech/WaveX/firmware/esp32/main/ui_task.cpp
        LV_LOCK();
        
        // Update enhanced meter display if available
        if (s_meter_bar_l && s_meter_bar_r && s_peak_line_l && s_peak_line_r &&
            lv_obj_is_valid(s_meter_bar_l) && lv_obj_is_valid(s_meter_bar_r) &&
            lv_obj_is_valid(s_peak_line_l) && lv_obj_is_valid(s_peak_line_r)) {
            
            // Update left channel RMS bar
            int rms_l_value = (int)(meter_data.rms_left * 100.0f);
            if (rms_l_value > 100) rms_l_value = 100;
            if (rms_l_value < 0) rms_l_value = 0;
            lv_bar_set_value(s_meter_bar_l, rms_l_value, LV_ANIM_ON);
            
            // Update right channel RMS bar
            int rms_r_value = (int)(meter_data.rms_right * 100.0f);
            if (rms_r_value > 100) rms_r_value = 100;
            if (rms_r_value < 0) rms_r_value = 0;
            lv_bar_set_value(s_meter_bar_r, rms_r_value, LV_ANIM_ON);
            
            // Update peak line positions
            update_peak_line_position(s_peak_line_l, s_meter_bar_l, s_peak_hold_l.peak_value);
            update_peak_line_position(s_peak_line_r, s_meter_bar_r, s_peak_hold_r.peak_value);
            
            // Update channel labels
            if (s_meter_label_l && lv_obj_is_valid(s_meter_label_l)) {
                char label_text[32];
                snprintf(label_text, sizeof(label_text), "L: %.3f\nPeak: %.3f", 
                        meter_data.rms_left, s_peak_hold_l.peak_value);
                lv_label_set_text(s_meter_label_l, label_text);
            }
            
            if (s_meter_label_r && lv_obj_is_valid(s_meter_label_r)) {
                char label_text[32];
                snprintf(label_text, sizeof(label_text), "R: %.3f\nPeak: %.3f", 
                        meter_data.rms_right, s_peak_hold_r.peak_value);
                lv_label_set_text(s_meter_label_r, label_text);
            }
        }
        
        // Fallback to legacy single meter display
        else if (s_meter_bar && s_meter_label && 
                 lv_obj_is_valid(s_meter_bar) && lv_obj_is_valid(s_meter_label)) {
            // Use RMS left channel for the bar (assuming stereo)
            float rms_value = meter_data.rms_left;
            int bar_value = (int)(rms_value * 100.0f);
            if (bar_value > 100) bar_value = 100;
            if (bar_value < 0) bar_value = 0;
            
            lv_bar_set_value(s_meter_bar, bar_value, LV_ANIM_ON);
            
            // Update label with current values
            char meter_text[64];
            snprintf(meter_text, sizeof(meter_text), "L: %.3f R: %.3f\nPeak L: %.3f R: %.3f", 
                    meter_data.rms_left, meter_data.rms_right, 
                    meter_data.peak_left, meter_data.peak_right);
            lv_label_set_text(s_meter_label, meter_text);
        }
        
        LV_UNLOCK();
    }
}

/**
 * @brief Create enhanced dual-channel meter display with peak hold
 */
static void create_enhanced_meter_display(lv_obj_t* parent)
{
    // Create meter container
    lv_obj_t *meter_area = lv_obj_create(parent);
    lv_obj_set_size(meter_area, lv_pct(45), lv_pct(90));
    lv_obj_set_style_bg_color(meter_area, lv_color_make(0xE8, 0xF5, 0xE8), LV_PART_MAIN);
    lv_obj_set_style_border_width(meter_area, 2, LV_PART_MAIN);
    lv_obj_set_style_border_color(meter_area, lv_color_make(0x4C, 0xAF, 0x50), LV_PART_MAIN);
    lv_obj_align(meter_area, LV_ALIGN_TOP_RIGHT, 0, 0);

    // Meter title
    lv_obj_t *meter_title = lv_label_create(meter_area);
    lv_label_set_text(meter_title, "Audio Meters");
    lv_obj_set_style_text_color(meter_title, lv_color_make(0x2E, 0x7D, 0x32), LV_PART_MAIN);
    lv_obj_set_style_text_font(meter_title, &lv_font_montserrat_18, LV_PART_MAIN);
    lv_obj_align(meter_title, LV_ALIGN_TOP_MID, 0, 5);

    // Left channel container
    lv_obj_t *left_channel = lv_obj_create(meter_area);
    lv_obj_set_size(left_channel, lv_pct(45), lv_pct(70));
    lv_obj_set_style_bg_color(left_channel, lv_color_make(0xF1, 0xF8, 0xE9), LV_PART_MAIN);
    lv_obj_set_style_border_width(left_channel, 1, LV_PART_MAIN);
    lv_obj_set_style_border_color(left_channel, lv_color_make(0x4C, 0xAF, 0x50), LV_PART_MAIN);
    lv_obj_align(left_channel, LV_ALIGN_LEFT_MID, 0, 0);

    // Left channel label
    lv_obj_t *left_label = lv_label_create(left_channel);
    lv_label_set_text(left_label, "LEFT");
    lv_obj_set_style_text_color(left_label, lv_color_make(0x2E, 0x7D, 0x32), LV_PART_MAIN);
    lv_obj_set_style_text_font(left_label, &lv_font_montserrat_14, LV_PART_MAIN);
    lv_obj_align(left_label, LV_ALIGN_TOP_MID, 0, 5);

    // Left channel RMS bar
    s_meter_bar_l = lv_bar_create(left_channel);
    lv_obj_set_size(s_meter_bar_l, lv_pct(80), 20);
    lv_obj_align(s_meter_bar_l, LV_ALIGN_CENTER, 0, -10);
    lv_bar_set_range(s_meter_bar_l, 0, 100);
    lv_bar_set_value(s_meter_bar_l, 0, LV_ANIM_OFF);
    lv_obj_set_style_bg_color(s_meter_bar_l, lv_color_make(0x4C, 0xAF, 0x50), LV_PART_INDICATOR);

    // Left channel peak line (initially hidden) - as child of meter bar
    s_peak_line_l = lv_obj_create(s_meter_bar_l);
    lv_obj_set_size(s_peak_line_l, 2, 20);
    lv_obj_set_style_bg_color(s_peak_line_l, lv_color_make(0xFF, 0x57, 0x22), LV_PART_MAIN);
    lv_obj_set_style_border_width(s_peak_line_l, 0, LV_PART_MAIN);
    lv_obj_set_pos(s_peak_line_l, 0, 0);
    lv_obj_add_flag(s_peak_line_l, LV_OBJ_FLAG_HIDDEN);

    // Left channel values label
    s_meter_label_l = lv_label_create(left_channel);
    lv_label_set_text(s_meter_label_l, "L: 0.000\nPeak: 0.000");
    lv_obj_set_style_text_color(s_meter_label_l, lv_color_make(0x2E, 0x7D, 0x32), LV_PART_MAIN);
    lv_obj_set_style_text_font(s_meter_label_l, &lv_font_montserrat_14, LV_PART_MAIN);
    lv_obj_align(s_meter_label_l, LV_ALIGN_BOTTOM_MID, 0, -5);

    // Right channel container
    lv_obj_t *right_channel = lv_obj_create(meter_area);
    lv_obj_set_size(right_channel, lv_pct(45), lv_pct(70));
    lv_obj_set_style_bg_color(right_channel, lv_color_make(0xF1, 0xF8, 0xE9), LV_PART_MAIN);
    lv_obj_set_style_border_width(right_channel, 1, LV_PART_MAIN);
    lv_obj_set_style_border_color(right_channel, lv_color_make(0x4C, 0xAF, 0x50), LV_PART_MAIN);
    lv_obj_align(right_channel, LV_ALIGN_RIGHT_MID, 0, 0);

