pmorgantech/WaveX/firmware/esp32/main/ui_task.cpp
    // Right channel label
    lv_obj_t *right_label = lv_label_create(right_channel);
    lv_label_set_text(right_label, "RIGHT");
    lv_obj_set_style_text_color(right_label, lv_color_make(0x2E, 0x7D, 0x32), LV_PART_MAIN);
    lv_obj_set_style_text_font(right_label, &lv_font_montserrat_14, LV_PART_MAIN);
    lv_obj_align(right_label, LV_ALIGN_TOP_MID, 0, 5);

    // Right channel RMS bar
    s_meter_bar_r = lv_bar_create(right_channel);
    lv_obj_set_size(s_meter_bar_r, lv_pct(80), 20);
    lv_obj_align(s_meter_bar_r, LV_ALIGN_CENTER, 0, -10);
    lv_bar_set_range(s_meter_bar_r, 0, 100);
    lv_bar_set_value(s_meter_bar_r, 0, LV_ANIM_OFF);
    lv_obj_set_style_bg_color(s_meter_bar_r, lv_color_make(0x4C, 0xAF, 0x50), LV_PART_INDICATOR);

    // Right channel peak line (initially hidden) - as child of meter bar
    s_peak_line_r = lv_obj_create(s_meter_bar_r);
    lv_obj_set_size(s_peak_line_r, 2, 20);
    lv_obj_set_style_bg_color(s_peak_line_r, lv_color_make(0xFF, 0x57, 0x22), LV_PART_MAIN);
    lv_obj_set_style_border_width(s_peak_line_r, 0, LV_PART_MAIN);
    lv_obj_set_pos(s_peak_line_r, 0, 0);
    lv_obj_add_flag(s_peak_line_r, LV_OBJ_FLAG_HIDDEN);

    // Right channel values label
    s_meter_label_r = lv_label_create(right_channel);
    lv_label_set_text(s_meter_label_r, "R: 0.000\nPeak: 0.000");
    lv_obj_set_style_text_color(s_meter_label_r, lv_color_make(0x2E, 0x7D, 0x32), LV_PART_MAIN);
    lv_obj_set_style_text_font(s_meter_label_r, &lv_font_montserrat_14, LV_PART_MAIN);
    lv_obj_align(s_meter_label_r, LV_ALIGN_BOTTOM_MID, 0, -5);

    // Peak hold info label
    lv_obj_t *peak_info = lv_label_create(meter_area);
    lv_label_set_text(peak_info, "Peak Hold: 500ms");
    lv_obj_set_style_text_color(peak_info, lv_color_make(0x66, 0x66, 0x66), LV_PART_MAIN);
    lv_obj_set_style_text_font(peak_info, &lv_font_montserrat_14, LV_PART_MAIN);
    lv_obj_align(peak_info, LV_ALIGN_BOTTOM_MID, 0, -5);
}

/**
 * @brief Meter data callback from Daisy
 */
static void meter_data_cb(float rms, float peak, void* user_data)
{
    // Debug logging for meter data
    ESP_LOGI(TAG, "Meter data received: RMS=%.3f, Peak=%.3f", rms, peak);
    
    s_current_rms = rms;
    s_current_peak = peak;
    
    // Call registered callback if any
    if (s_meter_callback) {
        s_meter_callback(rms, peak, s_meter_user_data);
    }
}

/**
 * @brief Update diagnostics information every 1 second
 */
static void diagnostics_update_cb(void *arg)
{
    // Update CPU usage
    update_cpu_usage();
    
    // Get ESP32 system metrics
    size_t free_heap = esp_get_free_heap_size();
    size_t min_free_heap = esp_get_minimum_free_heap_size();
    uint32_t uptime_ms = (uint32_t)(esp_timer_get_time() / 1000);
    
    // Get Daisy link status
    wavex_backend_heartbeat_t heartbeat;
    inter_mcu_get_backend_heartbeat(&heartbeat);
    
    // Get SPI link statistics
    spi_link_stats_t spi_stats;
    spi_link_get_stats(&spi_stats);
    bool spi_active = spi_link_is_active();
    
    // Get packet statistics
    wavex_packet_stats_t packet_stats;
    inter_mcu_get_packet_stats(&packet_stats);
    
    // Get meter data
    wavex_meter_data_t meter_data;
    inter_mcu_get_meter_data(&meter_data);
    
    // Calculate time since last heartbeat
    uint32_t time_since_last_rx = 999999;
    if (heartbeat.valid && heartbeat.last_rx_ms > 0) {
        time_since_last_rx = uptime_ms - heartbeat.last_rx_ms;
    }
    
    // Determine actual link status based on multiple factors
    const char* link_status = "INACTIVE";
    if (heartbeat.valid && time_since_last_rx < 2000) { // Received heartbeat within 2 seconds
        link_status = "ACTIVE";
    } else if (heartbeat.valid && time_since_last_rx < 5000) { // Received heartbeat within 5 seconds
        link_status = "STALE";
    } else if (spi_stats.packets_received > 0) { // Received some packets
        link_status = "PARTIAL";
    } else if (spi_active) { // SPI link is initialized but no data
        link_status = "INIT";
    }
    
    // Format diagnostic text with dual-core CPU usage and improved link status
    char diag_text[1024];
    snprintf(diag_text, sizeof(diag_text),
        "ESP32 Status:\n"
        "  Uptime: %lu sec\n"
        "  Free RAM: %zu KB\n"
        "  Min RAM: %zu KB\n"
        "  CPU Total: %.1f%%\n"
        "  CPU Core 0: %.1f%%\n"
        "  CPU Core 1: %.1f%%\n"
        "  CPU: ESP32-P4\n\n"
        "Daisy Link:\n"
        "  Status: %s\n"
        "  Last RX: %lu ms ago\n"
        "  Total Packets: %lu\n"
        "  Heartbeat: %lu\n"
        "  Meter Packets: %lu\n"
        "  CRC Errors: %lu\n"
        "  IRQ Count: %lu\n"
        "  SPI Active: %s\n\n"
        "Debug Info:\n"
        "  Heartbeat Valid: %s\n"
        "  Last Activity: %lu ms\n\n"
        "Audio Meters:\n"
        "  RMS L: %.3f R: %.3f\n"
        "  Peak L: %.3f R: %.3f\n"
        "  Valid: %s\n"
        "  Last Update: %lu ms ago\n\n"
        "Touch test area on the right",
        uptime_ms / 1000,
        free_heap / 1024,
        min_free_heap / 1024,
        s_cpu_usage_percent,
        s_cpu_usage_core0,
        s_cpu_usage_core1,
        link_status,
        time_since_last_rx,
        packet_stats.total_packets,
        packet_stats.heartbeat_packets,
        packet_stats.meter_push_packets,
        spi_stats.crc_errors,
        spi_stats.irq_count,
        spi_active ? "YES" : "NO",
        heartbeat.valid ? "YES" : "NO",
        spi_stats.last_activity_ms,
        meter_data.rms_left,
        meter_data.rms_right,
        meter_data.peak_left,
        meter_data.peak_right,
        meter_data.valid ? "YES" : "NO",
        meter_data.valid ? (uptime_ms - meter_data.last_update_ms) : 999999);
    
    // Update the diagnostics label if it exists and is valid
    LV_LOCK();
    if (s_diagnostics_label && lv_obj_is_valid(s_diagnostics_label)) {
        lv_label_set_text(s_diagnostics_label, diag_text);
    }
    LV_UNLOCK();
}
 
/**
 * @brief Initialize LVGL display using BSP (Recommended approach)
 */
 static esp_err_t init_lvgl_display(void)
 {
     ESP_LOGI(TAG, "Initializing LVGL display using BSP...");

