pmorgantech/WaveX/firmware/esp32/main/ui_task.cpp
    // Initialize LVGL core
    ESP_LOGI(TAG, "Initializing LVGL...");
    lv_init();

    // Check available memory before display initialization
    ESP_LOGI(TAG, "Memory before display init:");
    ESP_LOGI(TAG, "  Free heap: %zu bytes", esp_get_free_heap_size());
    ESP_LOGI(TAG, "  Minimum free heap: %zu bytes", esp_get_minimum_free_heap_size());

    // Use BSP's LVGL display setup with minimal config to prevent underruns
    ESP_LOGI(TAG, "Using BSP's LVGL display setup...");
    bsp_display_cfg_t cfg = {
        .lvgl_port_cfg = ESP_LVGL_PORT_INIT_CONFIG(),
        .buffer_size = 720 * 5,    // Very conservative: 5 lines × 720px × 2B = 7.2KB
        .double_buffer = false,   // Disable double buffering to reduce memory bandwidth
        .flags = {
            .buff_dma = true,
            .buff_spiram = false,
            .sw_rotate = true,   // Enable software rotation for HX8394
        }
    };

    s_lvgl_display = bsp_display_start_with_config(&cfg);
    ESP_RETURN_ON_FALSE(s_lvgl_display, ESP_FAIL, TAG, "Failed to start BSP display");

    // BSP disabled mirror operations for HX8394, so we need software rotation
    // Rotate 90 degrees clockwise
    LV_LOCK();
    lv_display_set_rotation(s_lvgl_display, LV_DISPLAY_ROTATION_90);
    LV_UNLOCK();

    // BSP handles touch setup automatically
    ESP_LOGI(TAG, "LVGL display initialized successfully");
    return ESP_OK;
 }
 
/**
 * @brief Monitor display pin states
 */
static void monitor_display_pins(void)
{
    ESP_LOGI(TAG, "Display pin status:");
    ESP_LOGI(TAG, "  Reset pin (GPIO%d): %d", WAVEX_ESP_DSI_RST, gpio_get_level((gpio_num_t)WAVEX_ESP_DSI_RST));
    ESP_LOGI(TAG, "  Backlight pin (GPIO%d): %d", WAVEX_ESP_DSI_BL, gpio_get_level((gpio_num_t)WAVEX_ESP_DSI_BL));
    ESP_LOGI(TAG, "  DSI D0P (GPIO%d): %d", WAVEX_ESP_DSI_D0P, gpio_get_level((gpio_num_t)WAVEX_ESP_DSI_D0P));
    ESP_LOGI(TAG, "  DSI D0N (GPIO%d): %d", WAVEX_ESP_DSI_D0N, gpio_get_level((gpio_num_t)WAVEX_ESP_DSI_D0N));
    ESP_LOGI(TAG, "  DSI D1P (GPIO%d): %d", WAVEX_ESP_DSI_D1P, gpio_get_level((gpio_num_t)WAVEX_ESP_DSI_D1P));
    ESP_LOGI(TAG, "  DSI D1N (GPIO%d): %d", WAVEX_ESP_DSI_D1N, gpio_get_level((gpio_num_t)WAVEX_ESP_DSI_D1N));
    ESP_LOGI(TAG, "  DSI CLKP (GPIO%d): %d", WAVEX_ESP_DSI_CLKP, gpio_get_level((gpio_num_t)WAVEX_ESP_DSI_CLKP));
    ESP_LOGI(TAG, "  DSI CLKN (GPIO%d): %d", WAVEX_ESP_DSI_CLKN, gpio_get_level((gpio_num_t)WAVEX_ESP_DSI_CLKN));
}

/**
 * @brief Create the main menu with navigation buttons
 */
static void create_main_menu(lv_obj_t *parent)
{
    if (parent == NULL) {
        ESP_LOGE(TAG, "create_main_menu: parent is NULL");
        return;
    }

    ESP_LOGI(TAG, "Creating main menu...");
    LV_LOCK();
    // Clear parent content
    lv_obj_clean(parent);

    // Create a flex container for menu buttons (optimized for landscape)
    lv_obj_t *menu_cont = lv_obj_create(parent);
    lv_obj_set_size(menu_cont, lv_pct(95), lv_pct(70));  // Adjusted for landscape
    lv_obj_set_style_bg_color(menu_cont, lv_color_white(), LV_PART_MAIN);
    lv_obj_set_style_border_width(menu_cont, 2, LV_PART_MAIN);
    lv_obj_set_style_border_color(menu_cont, lv_color_make(0xE0, 0xE0, 0xE0), LV_PART_MAIN);
    lv_obj_set_style_pad_all(menu_cont, 15, LV_PART_MAIN);  // Reduced padding
    lv_obj_center(menu_cont);

    // Set flex layout for landscape mode - 2x2 grid
    lv_obj_set_flex_flow(menu_cont, LV_FLEX_FLOW_ROW_WRAP);
    lv_obj_set_flex_align(menu_cont, LV_FLEX_ALIGN_SPACE_EVENLY, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER);

    // Create menu buttons (2x2 grid layout for landscape) - adjusted sizing for larger fonts
    lv_obj_t *btn1 = lv_btn_create(menu_cont);
    lv_obj_set_size(btn1, lv_pct(45), 100);  // Increased height for larger font
    lv_obj_add_event_cb(btn1, menu_button_event_cb, LV_EVENT_CLICKED, (void*)"system");
    lv_obj_t *label1 = lv_label_create(btn1);
    lv_label_set_text(label1, "System");
    lv_obj_set_style_text_font(label1, &lv_font_montserrat_20, LV_PART_MAIN);
    lv_obj_center(label1);

    lv_obj_t *btn2 = lv_btn_create(menu_cont);
    lv_obj_set_size(btn2, lv_pct(45), 100);
    lv_obj_add_event_cb(btn2, menu_button_event_cb, LV_EVENT_CLICKED, (void*)"audio");
    lv_obj_t *label2 = lv_label_create(btn2);
    lv_label_set_text(label2, "Audio");
    lv_obj_set_style_text_font(label2, &lv_font_montserrat_20, LV_PART_MAIN);
    lv_obj_center(label2);

    lv_obj_t *btn3 = lv_btn_create(menu_cont);
    lv_obj_set_size(btn3, lv_pct(45), 100);
    lv_obj_add_event_cb(btn3, menu_button_event_cb, LV_EVENT_CLICKED, (void*)"network");
    lv_obj_t *label3 = lv_label_create(btn3);
    lv_label_set_text(label3, "Network");
    lv_obj_set_style_text_font(label3, &lv_font_montserrat_20, LV_PART_MAIN);
    lv_obj_center(label3);

    lv_obj_t *btn4 = lv_btn_create(menu_cont);
    lv_obj_set_size(btn4, lv_pct(45), 100);
    lv_obj_add_event_cb(btn4, menu_button_event_cb, LV_EVENT_CLICKED, (void*)"settings");
    lv_obj_t *label4 = lv_label_create(btn4);
    lv_label_set_text(label4, "Settings");
    lv_obj_set_style_text_font(label4, &lv_font_montserrat_20, LV_PART_MAIN);
    lv_obj_center(label4);
    
    LV_UNLOCK();
}

/**
 * @brief Create the system submenu
 */
static void create_system_menu(lv_obj_t *parent)
{
    if (parent == NULL) {
        ESP_LOGE(TAG, "create_system_menu: parent is NULL");
        return;
    }

    ESP_LOGI(TAG, "Creating system menu...");
    LV_LOCK();
    // Clear parent content
    lv_obj_clean(parent);

    // Create a flex container for system options (optimized for landscape)
    lv_obj_t *menu_cont = lv_obj_create(parent);
    lv_obj_set_size(menu_cont, lv_pct(95), lv_pct(70));  // Adjusted for landscape
    lv_obj_set_style_bg_color(menu_cont, lv_color_white(), LV_PART_MAIN);
    lv_obj_set_style_border_width(menu_cont, 2, LV_PART_MAIN);
    lv_obj_set_style_border_color(menu_cont, lv_color_make(0xE0, 0xE0, 0xE0), LV_PART_MAIN);
    lv_obj_set_style_pad_all(menu_cont, 15, LV_PART_MAIN);  // Reduced padding
    lv_obj_center(menu_cont);

