pmorgantech/WaveX/firmware/esp32/main/ui_task.cpp
    // Set flex layout for landscape mode - horizontal layout
    lv_obj_set_flex_flow(menu_cont, LV_FLEX_FLOW_ROW_WRAP);
    lv_obj_set_flex_align(menu_cont, LV_FLEX_ALIGN_SPACE_EVENLY, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER);

    // Back button (full width at top) - adjusted for larger font
    lv_obj_t *back_btn = lv_btn_create(menu_cont);
    lv_obj_set_size(back_btn, lv_pct(100), 60);  // Increased height for larger font
    lv_obj_add_event_cb(back_btn, menu_button_event_cb, LV_EVENT_CLICKED, (void*)"back_main");
    lv_obj_t *back_label = lv_label_create(back_btn);
    lv_label_set_text(back_label, "< Back to Main Menu");
    lv_obj_set_style_text_font(back_label, &lv_font_montserrat_18, LV_PART_MAIN);
    lv_obj_center(back_label);

    // System options (side by side for landscape) - adjusted sizing
    lv_obj_t *btn1 = lv_btn_create(menu_cont);
    lv_obj_set_size(btn1, lv_pct(45), 100);  // Increased height for larger font
    lv_obj_add_event_cb(btn1, menu_button_event_cb, LV_EVENT_CLICKED, (void*)"diagnostics");
    lv_obj_t *label1 = lv_label_create(btn1);
    lv_label_set_text(label1, "Diagnostics");
    lv_obj_set_style_text_font(label1, &lv_font_montserrat_20, LV_PART_MAIN);
    lv_obj_center(label1);

    lv_obj_t *btn2 = lv_btn_create(menu_cont);
    lv_obj_set_size(btn2, lv_pct(45), 100);
    lv_obj_add_event_cb(btn2, menu_button_event_cb, LV_EVENT_CLICKED, (void*)"info");
    lv_obj_t *label2 = lv_label_create(btn2);
    lv_label_set_text(label2, "System Info");
    lv_obj_set_style_text_font(label2, &lv_font_montserrat_20, LV_PART_MAIN);
    lv_obj_center(label2);
    
    LV_UNLOCK();
}

/**
 * @brief Create the diagnostics page
 */
static void create_diagnostics_page(lv_obj_t *parent)
{
    if (parent == NULL) {
        ESP_LOGE(TAG, "create_diagnostics_page: parent is NULL");
        return;
    }

    LV_LOCK();
    // Clear parent content
    lv_obj_clean(parent);
    
    // Clear UI element references to prevent timer callbacks from accessing invalid objects
    s_diagnostics_label = NULL;
    s_meter_bar = NULL;
    s_meter_label = NULL;
    s_meter_bar_l = NULL;
    s_meter_bar_r = NULL;
    s_peak_line_l = NULL;
    s_peak_line_r = NULL;
    s_meter_label_l = NULL;
    s_meter_label_r = NULL;

    // Create diagnostics container (optimized for landscape)
    lv_obj_t *diag_cont = lv_obj_create(parent);
    lv_obj_set_size(diag_cont, lv_pct(98), lv_pct(100));  // Use full height of content area
    lv_obj_set_style_bg_color(diag_cont, lv_color_white(), LV_PART_MAIN);
    lv_obj_set_style_border_width(diag_cont, 2, LV_PART_MAIN);
    lv_obj_set_style_border_color(diag_cont, lv_color_make(0xE0, 0xE0, 0xE0), LV_PART_MAIN);
    lv_obj_set_style_pad_all(diag_cont, 10, LV_PART_MAIN);  // Reduced padding
    lv_obj_align(diag_cont, LV_ALIGN_TOP_MID, 0, 0);  // Align to top of content area

    // Title (larger font)
    lv_obj_t *title = lv_label_create(diag_cont);
    lv_label_set_text(title, "System Diagnostics");
    lv_obj_set_style_text_font(title, &lv_font_montserrat_22, LV_PART_MAIN);
    lv_obj_set_style_text_color(title, lv_color_make(0x2E, 0x34, 0x40), LV_PART_MAIN);
    lv_obj_align(title, LV_ALIGN_TOP_MID, 0, 0);

    // Back button (adjusted for larger font)
    lv_obj_t *back_btn = lv_btn_create(diag_cont);
    lv_obj_set_size(back_btn, 100, 40);  // Increased size for larger font
    lv_obj_add_event_cb(back_btn, menu_button_event_cb, LV_EVENT_CLICKED, (void*)"back_system");
    lv_obj_align(back_btn, LV_ALIGN_TOP_LEFT, 0, 0);
    lv_obj_t *back_label = lv_label_create(back_btn);
    lv_label_set_text(back_label, "< Back");
    lv_obj_set_style_text_font(back_label, &lv_font_montserrat_16, LV_PART_MAIN);
    lv_obj_center(back_label);

    // Create content area with side-by-side layout for landscape
    lv_obj_t *content = lv_obj_create(diag_cont);
    lv_obj_set_size(content, lv_pct(100), 620);  // Use most of available height (670 - 50 for title/back button)
    lv_obj_set_style_bg_color(content, lv_color_make(0xF8, 0xF9, 0xFA), LV_PART_MAIN);
    lv_obj_set_style_border_width(content, 1, LV_PART_MAIN);
    lv_obj_align(content, LV_ALIGN_TOP_MID, 0, 50);  // Position at top, below title
    lv_obj_set_style_pad_all(content, 8, LV_PART_MAIN);  // Reduced padding

    // Add diagnostic information (left side) - store reference for real-time updates
    s_diagnostics_label = lv_label_create(content);
    char diag_text[1024];
    snprintf(diag_text, sizeof(diag_text),
        "ESP32 Status:\n"
        "  Uptime: 0 sec\n"
        "  Free RAM: %zu KB\n"
        "  Min RAM: %zu KB\n"
        "  CPU: ESP32-P4\n\n"
        "Daisy Link:\n"
        "  Status: CHECKING...\n"
        "  Last RX: -- ms ago\n"
        "  Total Packets: 0\n"
        "  Heartbeat: 0\n"
        "  CRC Errors: 0\n"
        "  IRQ Count: 0\n\n"
        "Touch test area on the right",
        (size_t)(esp_get_free_heap_size() / 1024),
        (size_t)(esp_get_minimum_free_heap_size() / 1024));
    lv_label_set_text(s_diagnostics_label, diag_text);
    lv_obj_set_style_text_font(s_diagnostics_label, &lv_font_montserrat_16, LV_PART_MAIN);  // Larger font for diagnostics
    lv_obj_align(s_diagnostics_label, LV_ALIGN_TOP_LEFT, 0, 0);

    // Create enhanced dual-channel meter display
    create_enhanced_meter_display(content);

    // Add touch test area below meter
    lv_obj_t *touch_area = lv_obj_create(content);
    lv_obj_set_size(touch_area, lv_pct(45), lv_pct(25));  // Smaller for touch test
    lv_obj_set_style_bg_color(touch_area, lv_color_make(0xE3, 0xF2, 0xFD), LV_PART_MAIN);
    lv_obj_set_style_border_width(touch_area, 2, LV_PART_MAIN);
    lv_obj_set_style_border_color(touch_area, lv_color_make(0x21, 0x96, 0xF3), LV_PART_MAIN);
    lv_obj_align(touch_area, LV_ALIGN_BOTTOM_RIGHT, 0, 0);  // Bottom right

    lv_obj_t *touch_label = lv_label_create(touch_area);
    lv_label_set_text(touch_label, "Touch Test");
    lv_obj_set_style_text_color(touch_label, lv_color_make(0x15, 0x65, 0xC0), LV_PART_MAIN);
    lv_obj_set_style_text_font(touch_label, &lv_font_montserrat_16, LV_PART_MAIN);
    lv_obj_center(touch_label);

    // Add touch event handler
    lv_obj_add_event_cb(touch_area, touch_event_cb, LV_EVENT_PRESSED, NULL);
    lv_obj_add_event_cb(touch_area, touch_event_cb, LV_EVENT_RELEASED, NULL);
    
