pmorgantech/WaveX/firmware/esp32/main/ui_task.cpp
    LV_UNLOCK();
}

/**
 * @brief Menu button event callback
 */
static void menu_button_event_cb(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    const char *btn_id = (const char *)lv_event_get_user_data(e);

    if (code == LV_EVENT_CLICKED) {
        if (btn_id == NULL) {
            ESP_LOGE(TAG, "Menu button clicked with NULL ID");
            return;
        }

        ESP_LOGI(TAG, "Menu button clicked: %s", btn_id);

        // Use the stored content area reference
        if (s_content_area == NULL) {
            ESP_LOGE(TAG, "Content area not initialized for menu navigation");
            return;
        }
        
        // Additional safety check
        if (!lv_obj_is_valid(s_content_area)) {
            ESP_LOGE(TAG, "Content area is not a valid LVGL object");
            return;
        }

        if (strcmp(btn_id, "system") == 0) {
            ESP_LOGI(TAG, "Navigating to system menu...");
            create_system_menu(s_content_area);
        } else if (strcmp(btn_id, "diagnostics") == 0) {
            ESP_LOGI(TAG, "Navigating to diagnostics page...");
            create_diagnostics_page(s_content_area);
        } else if (strcmp(btn_id, "back_main") == 0) {
            ESP_LOGI(TAG, "Navigating back to main menu...");
            create_main_menu(s_content_area);
        } else if (strcmp(btn_id, "back_system") == 0) {
            ESP_LOGI(TAG, "Navigating back to system menu...");
            create_system_menu(s_content_area);
        } else {
            ESP_LOGI(TAG, "Menu option '%s' selected", btn_id);
        }
    }
}

/**
 * @brief Touch event callback for testing
 */
static void touch_event_cb(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    lv_obj_t *obj = (lv_obj_t *)lv_event_get_target(e);

    if (code == LV_EVENT_PRESSED) {
        ESP_LOGI(TAG, "Touch pressed on test area");
        // Note: Event callbacks run in LVGL context, no locking needed
        lv_obj_set_style_bg_color(obj, lv_color_make(0xFF, 0xEB, 0x3B), LV_PART_MAIN);
        lv_obj_t *label = lv_obj_get_child(obj, 0);
        if (label) {
            lv_label_set_text(label, "Touch Detected!\nKeep pressing...");
            lv_obj_set_style_text_font(label, &lv_font_montserrat_18, LV_PART_MAIN);  // Ensure larger font
        }
    } else if (code == LV_EVENT_RELEASED) {
        ESP_LOGI(TAG, "Touch released from test area");
        // Note: Event callbacks run in LVGL context, no locking needed
        lv_obj_set_style_bg_color(obj, lv_color_make(0xE3, 0xF2, 0xFD), LV_PART_MAIN);
        lv_obj_t *label = lv_obj_get_child(obj, 0);
        if (label) {
            lv_label_set_text(label, "Touch Test Area\nTap here to test touchscreen!");
            lv_obj_set_style_text_font(label, &lv_font_montserrat_18, LV_PART_MAIN);  // Ensure larger font
        }
    }
}

/**
 * @brief UI task implementation
 */
 static void ui_task(void *pvParameters)
 {
    ESP_LOGI(TAG, "UI task started with full UI support");

    // Initialize LVGL display
    ESP_LOGI(TAG, "Initializing LVGL display...");

    // Initialize LVGL display
    esp_err_t lvgl_ret = init_lvgl_display();
    if (lvgl_ret != ESP_OK) {
         ESP_LOGE(TAG, "Failed to initialize LVGL display: %s", esp_err_to_name(lvgl_ret));
         vTaskDelete(NULL);
         return;
    }

    ESP_LOGI(TAG, "LVGL display initialized successfully");

    // Log memory status
    ESP_LOGI(TAG, "Memory after display init:");
    ESP_LOGI(TAG, "  Free heap: %zu bytes", esp_get_free_heap_size());

    // Create the main UI
    ESP_LOGI(TAG, "Creating main UI...");
    LV_LOCK();
    lv_obj_t *main_screen = lv_screen_active();
    lv_obj_set_style_bg_color(main_screen, lv_color_white(), LV_PART_MAIN);
    
    // Create header (reduced height for landscape mode)
    lv_obj_t *header = lv_obj_create(main_screen);
    lv_obj_set_size(header, lv_pct(100), 50);  // Reduced from 80 to 50
    lv_obj_set_style_bg_color(header, lv_color_make(0x2E, 0x34, 0x40), LV_PART_MAIN);
    lv_obj_set_style_border_width(header, 0, LV_PART_MAIN);
    lv_obj_align(header, LV_ALIGN_TOP_MID, 0, 0);
    
    // Add title to header (larger font)
    lv_obj_t *title = lv_label_create(header);
    lv_label_set_text(title, "WaveX System");
    lv_obj_set_style_text_color(title, lv_color_white(), LV_PART_MAIN);
    lv_obj_set_style_text_font(title, &lv_font_montserrat_24, LV_PART_MAIN);
    lv_obj_center(title);
    
    // Create content area (adjusted for landscape mode)
    lv_obj_t *content = lv_obj_create(main_screen);
    lv_obj_set_size(content, lv_pct(100), 670);  // 720 - 50 = 670 pixels (full height minus header)
    lv_obj_set_style_bg_color(content, lv_color_white(), LV_PART_MAIN);
    lv_obj_set_style_border_width(content, 0, LV_PART_MAIN);
    lv_obj_align(content, LV_ALIGN_TOP_MID, 0, 50);  // Position below header
    
    // Store content area reference for menu navigation
    s_content_area = content;
    
    // Create main menu
    create_main_menu(content);
    LV_UNLOCK();

    ESP_LOGI(TAG, "Main UI created successfully");

    // Create diagnostics update timer (every 1 second)
    const esp_timer_create_args_t diag_timer_args = {
        .callback = &diagnostics_update_cb,
        .name = "diagnostics_timer"
    };
    esp_err_t timer_ret = esp_timer_create(&diag_timer_args, &s_diagnostics_timer_handle);
    if (timer_ret == ESP_OK) {
        esp_timer_start_periodic(s_diagnostics_timer_handle, 1000000); // 1 second in microseconds
        ESP_LOGI(TAG, "Diagnostics timer started (1s updates)");
    } else {
        ESP_LOGE(TAG, "Failed to create diagnostics timer: %s", esp_err_to_name(timer_ret));
    }

    // Create meter update timer (every 50ms for real-time updates)
    const esp_timer_create_args_t meter_timer_args = {
        .callback = &meter_update_cb,
        .name = "meter_timer"
    };
    timer_ret = esp_timer_create(&meter_timer_args, &s_meter_timer_handle);
    if (timer_ret == ESP_OK) {
        esp_timer_start_periodic(s_meter_timer_handle, 50000); // 50ms in microseconds
        ESP_LOGI(TAG, "Meter timer started (50ms real-time updates)");
    } else {
        ESP_LOGE(TAG, "Failed to create meter timer: %s", esp_err_to_name(timer_ret));
    }

    // Register meter data callback for real-time audio meter updates
    inter_mcu_set_meter_listener(meter_data_cb, NULL);
    ESP_LOGI(TAG, "Meter data callback registered");
    
